tap "alesbrelih/gitlab-ci-ls"
tap "charmbracelet/tap", trusted: true
tap "derailed/popeye"
tap "hashicorp/tap", trusted: true
tap "hedhyw/main"
tap "janosmiko/tap"
tap "mm7894215/tokentracker", trusted: { formulae: ["tokentracker"] }
tap "secureauthcorp/tap", "https://github.com/SecureAuthCorp/homebrew-tap.git", trusted: true
tap "skyhook-io/tap"
tap "vitorgalvao/tiny-scripts"
# Run your GitHub Actions locally
brew "act"
# Simple, modern, secure file encryption
brew "age"
# Slice and dice log files on the command-line
brew "angle-grinder"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Planetarium for your terminal
brew "astroterm"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# C99 library implementation of AWS client-side authentication
brew "aws-c-auth"
# Extremely Fast Compression algorithm
brew "lz4"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Official Amazon AWS command-line interface
brew "awscli"
# Curl like simplicity to access AWS resources
brew "awscurl"
# Text-based UI library
brew "ncurses"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Console-based Audio Visualizer for ALSA
brew "cava"
# Tool for managing Juju Charms
brew "charm"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Statistics utility to count lines of code
brew "cloc"
# Utility for connecting securely to your Cloud SQL instances
brew "cloud-sql-proxy"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: :changed
# GNU File, Shell, and Text utilities
brew "coreutils"
# Container Signing
brew "cosign"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Synchronize your DNS to multiple providers from a simple DSL
brew "dnscontrol"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Perform least recently used (LRU) eviction of Docker images
brew "docuum"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Quickly find duplicates in a set of files from the command-line
brew "duff"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# SDL2 compatibility layer that uses SDL3 behind the scenes
brew "sdl2-compat"
# H.265/HEVC encoder
brew "x265"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# Geometry Engine
brew "geos"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Git extension to generate reports for standup meetings
brew "git-standup"
# Open-source GitLab command-line tool
brew "glab"
# Render markdown on the CLI
brew "glow"
# Command-line option parsing utility
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Common error values for all GnuPG components
brew "libgpg-error"
# Library for USB device access
brew "libusb"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Log analyzer and interactive viewer for the Apache Webserver
brew "goaccess"
# Library access to GnuPG
brew "gpgme"
# Ping, but with a graph
brew "gping"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Command-line tool for generating regular expressions
brew "grex"
# Make JSON greppable
brew "gron"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Command-line interface for Hetzner Cloud
brew "hcloud"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# CLI for headscale, an open-source implementation of the Tailscale control server
brew "headscale-cli"
# Kubernetes package manager
brew "helm"
# Command-line hex viewer
brew "hexyl"
# <hr />, for your terminal window
brew "hr"
# Advanced HTML-to-text converter
brew "html2text"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Curl statistics made simple
brew "httpstat"
# Add GitHub support to git on the command-line
brew "hub"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# Display an interface's bandwidth usage
brew "iftop"
# Modular IRC client
brew "irssi"
# Serializes the output of command-line tools to structured JSON output
brew "jc"
# JSON diff and patch
brew "jd"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON parser and validator with a CLI
brew "jsonlint"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Colorize your kubectl output
brew "kubecolor"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Lazier way to manage everything docker
brew "lazydocker"
# Multi-format archive and compression library
brew "libarchive"
# Vulkan Header files and API registry
brew "vulkan-headers"
# Vulkan ICD Loader
brew "vulkan-loader"
# Lynx-like WWW browser that supports tables, menus, etc.
brew "links"
# Rainbows and unicorns in your console!
brew "lolcat"
# Security and system auditing tool to harden systems
brew "lynis"
# Easily convert Marp Markdown files into static HTML/CSS, PDF, PPT and images
brew "marp-cli"
# Mac App Store command-line interface
brew "mas"
# Syntax-aware git merge driver
brew "mergiraf"
# Fast and user friendly build system
brew "meson"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# No Nonsense Neovim Client in Rust
brew "neovide"
# Net top tool grouping bandwidth per process
brew "nethogs"
# Port scanning utility for large networks
brew "nmap"
# Libraries for security-enabled client and server applications
brew "nss"
# User-friendly CLI for OAuth2
brew "oauth2c"
# Development kit for the Java programming language
brew "openjdk"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Simplistic interactive filtering tool
brew "peco"
# Parallel gzip
brew "pigz"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Optimizer for PNG files
brew "pngcrush"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@17", link: true
# Object-relational database system
brew "postgresql@18"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Cartographic Projections Library
brew "proj"
# Monitor data's progress through a pipe
brew "pv"
# Password generator
brew "pwgen"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Ultra-fast CSV data-wrangling toolkit
brew "qsv"
# Cross-platform application and UI framework
brew "qt"
# Rsync for cloud storage
brew "rclone"
# Generate C-based recognizers from regular expressions
brew "re2c"
# Web Reconnaissance Framework
brew "recon-ng"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Automated dependency updates. Flexible so you don't need to be
brew "renovate"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Prevent committing secret keys into your source code
brew "ripsecrets"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Safe, concurrent, practical language
brew "rust"
# Get, set, and list display resolution
brew "screenresolution"
# Intuitive find & replace CLI
brew "sd"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Python library and command-line utility for Shodan
brew "shodan"
# Count lines of code in many languages
brew "sloccount"
# Yet another network load monitor
brew "slurm"
# Data wrangler with jq-like query language
brew "sq"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Non-interactive SSH password auth
brew "sshpass"
# Cross-shell prompt for astronauts
brew "starship"
# Version control system designed to be a better CVS
brew "subversion"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Tool Command Language
brew "tcl-tk"
# User interface to the TELNET protocol
brew "telnet"
# Text interface for Git repositories
brew "tig"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Find and verify credentials
brew "trufflehog"
# Vi 'workalike' with many additional features
brew "vim"
# Image processing library
brew "vips"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Userspace Go implementation of WireGuard
brew "wireguard-go"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Bring your favorite shell wherever you go through the ssh
brew "xxh"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Gitlab CI Language Server
brew "alesbrelih/gitlab-ci-ls/gitlab-ci-ls", trusted: true
# A Kubernetes Cluster sanitizer and linter!
brew "derailed/popeye/popeye", trusted: true
# Packer
brew "hashicorp/tap/packer"
# JSON Log Viewer tool.
brew "hedhyw/main/jlv", trusted: true
# Lightning Fast Kubernetes navigator - keyboard-focused TUI for managing K8s clusters
brew "janosmiko/tap/lfk", trusted: true
# Modern Kubernetes visibility — topology, traffic, and Helm management
brew "skyhook-io/tap/radar", trusted: true
# Quickly repair outdated/broken Casks from homebrew-cask
brew "vitorgalvao/tiny-scripts/cask-repair", trusted: true
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Terminal interface for Antigravity agents
cask "antigravity-cli"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Log analysis tool
cask "chipmunk"
# Anthropic's official Claude AI desktop app
cask "claude"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Server and cloud storage browser
cask "cyberduck"
# Virtual monitor for screen sharing
cask "deskpad"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "font-zed-mono-nerd-font"
# PDF reader
cask "foxitreader"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Open-source video transcoder
cask "handbrake-app"
# Utility to hide menu bar items
cask "hiddenbar"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# Desktop shield and keystroke interceptor
cask "keyboard-cleaner"
# Show key presses on screen
cask "keyscreen"
# GPU-based terminal emulator
cask "kitty"
# Discover, download, and run local LLMs
cask "lm-studio"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Professional webcam software for the Opal C1
cask "opal-composer"
# AI coding agent desktop client
cask "opencode-desktop"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Workspace simplifier - to organize your workspace and boost your productivity
cask "rambox"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Customizable email client
cask "thunderbird"
# Local-first AI token usage tracker menu bar app
cask "mm7894215/tokentracker/tokentracker", trusted: true
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark-app"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
